# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'sdkman/tap'
tap 'kreuzwerker/taps'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'sdkman-cli' 
brew 'miniconda' 
brew 'kreuzwerker/taps/awsu' 
brew 'z' 
# brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'

# Apps
cask '1password'
cask 'docker'
cask 'firefox'
cask 'slack'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'microsoft-teams'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'miro'
cask 'dropbox'
cask 'handbrake'
cask 'iterm2'
cask 'postman'
cask 'rectangle'
cask 'signal'
cask 'spotify'
cask 'TeamViewer'
# cask 'intellij-idea-ce'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'OneDrive', id: 823766827
