# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'z' 
brew 'svn' # Needed to install fonts
brew 'bfg' # https://rtyley.github.io/bfg-repo-cleaner/
brew 'yarn'
brew 'docker-compose'
brew 'ykman'
brew 'nano'
brew 'gum'

# Development
brew 'imagemagick'

# Apps
cask 'hazel'
cask '1password'
cask 'docker'
cask 'firefox'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'miniconda' 
cask 'dropbox'
cask 'iterm2'
cask 'postman'
cask 'rectangle'
cask 'signal'
cask 'spotify'
cask 'TeamViewer'
cask 'spitfire-audio'
cask 'bartender'
cask 'doxie'
cask 'chatgpt'
cask 'warp'
cask 'google-drive'
cask 'audacity'
cask 'bartender'
cask 'brave-browser'
cask 'focusrite-control'
cask 'gimp'
cask 'inkscape'
cask 'logi-options-plus'
cask 'obs'
cask 'obsidian'
cask 'ollama'
cask 'raspberry-pi-imager'
cask 'r'
cask 'rstudio'
cask 'vlc'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-meslo-lg-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'Yubico Authenticator', id: 1497506650
mas 'Adobe Lightroom', id: 1451544217